//- Є змінна х, якій ви надаєте довільне числове значення.
//    Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//let x= prompt('Введіть довільне число');
//if (x>0)
//{
   // console.log('Вірно');
//}
 //   else
//{
   // console.log(" Не вірно");
//}

//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).
//let time=prompt('Ведіть числа від 0 до 59')
  //  if (time<=15)
  //  {
   //     console.log('Перша чверть');
   // }
  //  else if (time<=16 || time<=30)
   // {
  //      console.log( 'Друга чверть');
   // }
  //  else if (time<=31 || time<=45)
   // {
   //     console.log('Третя чверть');
   // }
   // else if (time<=46 || time<=59)
   // {
   //     console.log('Четверта чверть');
   // }
   // else {
  //      console.log('Ведіть числа від 0 до 59');
  //  }
//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
 //let day=prompt('Введіть число від 1 до 31');
   // if(day <= 10)
   // {
    //    console.log( 'Перша декада');
    //}
   // else if (day<=11 || day<= 20)
    //{
    //    console.log('Друга декада');
    //}
   // else if(day<=21 || day<=31)
   // {
    //    console.log('Третя декада');
   // }
   // else {
    //    console.log('Ви вводите числа поза діазоном');
   // }


// Скласти розклад на тиждень за домопоги switch.
//Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
    //let d = prompt('Введіть порядковий номер дня');
    //switch (d)  {
            //case '1':
            //console.log('Work');
           // break;
           // case '2':
            //console.log('Work');
            //break;
           // case '3':
           // console.log('Work');
           // break;
           // case '4':
          //  console.log('Work');
           // break;
           // case '5':
           // console.log('Work');
           // break;
           // case '6':
           // console.log('Sleep');
           // break;
           // case '7':
           // console.log('Sleep');
           // break;
       // default:
            //console.log('Введіть число з діапазону від 1 до 7');

    //}

    //Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
   // - Користувач вводить або має два числа.
    //    Потрібно знайти та вивести максимальне число з тих двох .
     //   Також потрібно врахувати коли введені рівні числа.

  // let w = prompt('Введіть перше числo ');
   // let r=prompt('Введіть друге число');
   // if (w>r)
   // {
  //      console.log(+w);
  //  }
  //  else if (w===r)
  //  {
  //      console.log('Числа рівні');
  //  }
  //  else
  //  {
  //      console.log(+r);
   // }

   // - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).
// Напишіть код який,за допомоги  оператора || буде присвоювати змінній х значення "default"
//     якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

let x=prompt('Введіть будь-що');
    if (x===null || x===isNaN(NaN)  || x===false || x===undefined || +x===0 || +x===-0)
    {
        console.log ('default');
    }
    else
    {
        console.log(x);
    }

